
# Вектора -----------------------------------------------------------------

# Numeric или double ------------------------------------------------------

class(2.1)

# Integer -----------------------------------------------------------------

1L
class(1L)

# Character ------------------------------------------------------------------

'text 1'
"text 2"
'название этой функции "class"'
"название 'class'"
class('text 1')
class("text 1")

# Logical -----------------------------------------------------------------

TRUE
FALSE
T
F
class(TRUE)

# Factor ------------------------------------------------------------------

factor(x = 2, levels = 2, labels = 'Женский')

factor(x = 2,
       levels = 2,
       labels = 'Женский')

class(factor(x = 2, levels = 2, labels = 'Женский'))

## Фактор из нескольких элементов

factor(x = c(1, 2, 1, 1, 2),
       levels = c(1, 2),
       labels = c('Мужской', 'Женский'))

## Фактор из нескольких элементов без уточнения аргументов

factor(c(1, 2, 1, 1, 2), c(1, 2, 3), c('Мужской', 'Женский', 'Не определился'))

factor(
  x = c(1, 2, 1, 1, 2, 3, 1),
  levels = c(1, 2),
  labels = c("Мужской", "Женский")
)

# Classes -----------------------------------------------------------------

class(1L)
class(factor(x = 2, levels = 2, labels = 'Женский'))

c(1, 2L)
class(c(1, 2L))

# Data frames -------------------------------------------------------------

data.frame(
  id = c(1, 2, 3),
  gender = factor(c(1, 2, 1), c(1, 2), c('Мужской', 'Женский')),
  answer1 = c(5, 4, 3),
  comments = c('не', 'не', 'не не')
)

install.packages('tidyverse')
library(tidyverse)

# Tibbles -----------------------------------------------------------------

## Создание переменных 

df <- tibble(
  id = c(1, 2, 3),
  gender = factor(c(1, 2, 1), c(1, 2), c('Мужской', 'Женский')),
  answer1 = c(1, 1, 2),
  comments = c('не', 'не', 'не не')
)

vector_1 <- c(1, 2, 3, 4)
vector_2 <- 2

tibble(
  id = c(1, 2, 3),
  gender = factor(c(1, 2, 1), c(1, 2), c('Мужской', 'Женский')),
  answer1 = c(1, 1, 2),
  comments = c('не', 'не', 'не не')
) -> df2

## Не рекомендуется используется этот знак 

df3 = tibble(
  id = c(1, 2, 3),
  gender = factor(c(1, 2, 1), c(1, 2), c('Мужской', 'Женский')),
  answer1 = c(1, 1, 2),
  comments = c('не', 'не', 'не не')
)

## Удаление переменных

rm(df)
ls()
rm(list = ls())

